Revit 2027 API
AssetPropertyDoubleArray4d.SetValueAsDoubles Method
 Sets the value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValueAsDoubles(
	IList<double> value
)
Public Sub SetValueAsDoubles (
	value As IList(Of Double)
)
public:
void SetValueAsDoubles(
	IList<double>^ value
)
member SetValueAsDoubles :
        value : IList<float> -> unit
Parameters
value IList<Double>
 The new value as doubles.
Exceptions
Exception | Condition
ArgumentException |  The input value is invalid for this AssetPropertyDoubleArray4d property.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace